; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v1 - type_2 ?v4 - type_3)
 	      (pred_3 ?v8 - object ?v4 - type_3)
	      (pred_1 ?v1 - type_2 ?v3 - type_1)
	      (pred_2 ?v1 - type_2 ?v8 - object ?v3 - type_1))

   (:action op_1
       :parameters  (?v1 - type_2 ?v6 ?v7 - type_3)
       :precondition (and  (pred_4 ?v1 ?v6))
       :effect (and  (pred_4 ?v1 ?v7)
		     (not (pred_4 ?v1 ?v6))))

   (:action op_3
       :parameters (?v1 - type_2 ?v5 - object ?v2 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_3 ?v5 ?v2) (pred_4 ?v1 ?v2) (pred_1 ?v1 ?v3))
       :effect (and (pred_2 ?v1 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v2)) 
		    (not (pred_1 ?v1 ?v3))))

   (:action op_2
       :parameters (?v1 - type_2 ?v5 - object ?v2 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v5 ?v3) (pred_4 ?v1 ?v2))
       :effect (and (pred_3 ?v5 ?v2)
		    (pred_1 ?v1 ?v3)
		    (not (pred_2 ?v1 ?v5 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_2
obj_01 obj_06 - type_1
obj_02 obj_09 obj_08 - type_3
obj_03 obj_07 obj_05 - object)
(:init
(pred_4 obj_04 obj_08)
(pred_1 obj_04 obj_01)
(pred_1 obj_04 obj_06)
(pred_3 obj_03 obj_08)
(pred_3 obj_07 obj_09)
(pred_3 obj_05 obj_02)
)
(:goal
(and
(pred_3 obj_03 obj_08)
(pred_3 obj_07 obj_09)
(pred_3 obj_05 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_04 ?b obj_06))))
)
)

; plan
1. (op_1 obj_04 obj_08 obj_02)
   deleted: (pred_4 obj_04 obj_08)
   added: (pred_4 obj_04 obj_02)
   goals met: 2 of 3
2. (op_3 obj_04 obj_05 obj_02 obj_01)
   deleted: (pred_3 obj_05 obj_02) (pred_1 obj_04 obj_01)
   added: (pred_2 obj_04 obj_05 obj_01)
   goals met: 2 of 3
3. (op_1 obj_04 obj_02 obj_08)
   deleted: (pred_4 obj_04 obj_02)
   added: (pred_4 obj_04 obj_08)
   goals met: 2 of 3
4. (op_2 obj_04 obj_05 obj_08 obj_01)
   deleted: (pred_2 obj_04 obj_05 obj_01)
   added: (pred_3 obj_05 obj_08) (pred_1 obj_04 obj_01)
   goals met: 3 of 3
